Repository: RomanDevelop/cyber-security-app
Catalog: lib/l10n/app_*.arb
Languages: uk

# appTitle
source: MockIPTV Auditor
uk: MockIPTV Аудитор

# educationalTool
source: Educational Tool for Mobile App Auditors
uk: Освітній інструмент для аудиторів мобільних додатків

# appDescription
source: This educational app demonstrates common techniques used by malicious applications to disguise themselves as legitimate VPN, IPTV, or utility apps. Learn to identify red flags and suspicious patterns in mobile applications.
uk: Цей освітній додаток демонструє поширені техніки, які використовують шкідливі програми для маскування під легітимні VPN, IPTV або утилітарні додатки. Навчіться розпізнавати червоні прапорці та підозрілі патерни в мобільних додатках.

source: Open Sample App Page
uk: Відкрити сторінку зразка додатку

source: Start Audit Checklist
uk: Розпочати чек-лист аудиту

source: Red Flags Guide
uk: Посібник з червоних прапорців

source: Knowledge Quiz
uk: Вікторина знань

source: For Instructors
uk: Для викладачів

source: Educational Purpose Only
uk: Тільки для освітніх цілей

# safetyDisclaimer
source: This is a safe, non-functional educational demo. Do not use for harmful purposes.
uk: Це безпечна, нефункціональна освітня демонстрація. Не використовуйте для шкідливих цілей.

source: Unknown Developer
uk: Невідомий розробник

# suspiciousDescription
source: Watch thousands of IPTV channels from around the world. Access premium content and live sports. Install this app to view restricted IPTV streams - enable SMS verification for premium access.
uk: Дивіться тисячі IPTV каналів з усього світу. Доступ до преміум контенту та прямі трансляції спорту. Встановіть цей додаток для перегляду обмежених IPTV потоків - увімкніть SMS верифікацію для преміум доступу.

# vpnDescription
source: Secure your internet connection with our premium VPN service. Bypass geo-restrictions and protect your privacy. Free trial available with SMS verification.
uk: Захистіть своє інтернет-з'єднання нашим преміум VPN сервісом. Обходьте гео-обмеження та захистіть свою приватність. Безкоштовний пробний період з SMS верифікацією.

# requestedPermissions
source: Requested Permissions (Simulated)
uk: Запитувані дозволи (симуляція)

source: Developer Information
uk: Інформація про розробника

source: Reviews
uk: Відгуки

source: Screenshots
uk: Скріншоти

source: Description
uk: Опис

source: Permission Mismatch Analysis
uk: Аналіз невідповідності дозволів

source: Claimed Functionality
uk: Заявлена функціональність

# requestedPermissionsColumn
source: Requested Permissions
uk: Запитувані дозволи

source: Status
uk: Статус

source: Legitimate
uk: Легітимний

source: Suspicious
uk: Підозрілий

source: Critical
uk: Критичний

source: Red Flags Detected
uk: Виявлено червоні прапорці

source: Audit Recommendations
uk: Рекомендації з аудиту

# quizTitle
source: Quiz - Question {questionNumber}/8
uk: Вікторина - Питання {questionNumber}/8

# question
source: Question {questionNumber}
uk: Питання {questionNumber}

source: Correct!
uk: Правильно!

source: Incorrect
uk: Неправильно

source: Explanation:
uk: Пояснення:

source: Next Question
uk: Наступне питання

source: View Results
uk: Переглянути результати

source: Quiz Results
uk: Результати вікторини

# yourScore
source: Your Score: {score} out of {total}
uk: Ваш результат: {score} з {total}

source: Retake Quiz
uk: Перескласти вікторину

source: Review Red Flags Guide
uk: Переглянути посібник з червоних прапорців

source: Back to Home
uk: Повернутися на головну

source: Reset Quiz
uk: Скинути вікторину

# resetQuizConfirmation
source: Are you sure you want to reset the quiz? This will clear your current progress.
uk: Ви впевнені, що хочете скинути вікторину? Це очистить ваш поточний прогрес.

source: Cancel
uk: Скасувати

source: Reset
uk: Скинути

source: Close
uk: Закрити

source: Copy
uk: Копіювати

source: Content copied to clipboard
uk: Контент скопійовано в буфер обміну

source: Analyzing
uk: Аналіз

source: Developer
uk: Розробник

source: Permission Analysis
uk: Аналіз дозволів

source: Suspicious Permissions Detected
uk: Виявлено підозрілі дозволи

source: View Red Flags Guide
uk: Переглянути посібник з червоних прапорців

# question1
source: An IPTV app requests permission to READ_SMS. What should you do?
uk: IPTV додаток запитує дозвіл на READ_SMS. Що ви повинні зробити?

# question1Option1
source: Allow it - SMS access is needed for user verification
uk: Дозволити - доступ до SMS потрібен для верифікації користувача

# question1Option2
source: Flag it for review - SMS access is suspicious for IPTV apps
uk: Позначити для перевірки - доступ до SMS підозрілий для IPTV додатків

# question1Option3
source: Install it anyway - the permission might be for a legitimate feature
uk: Встановити все одно - дозвіл може бути для законної функції

# question1Option4
source: Check if the app has good reviews first
uk: Спочатку перевірити, чи є у додатку хороші відгуки

# question1Explanation
source: SMS access is rarely required for IPTV functionality and is a major red flag. This permission could be used to intercept 2FA codes or steal sensitive information. Always flag apps with permission mismatches for manual review.
uk: Доступ до SMS рідко потрібен для функціональності IPTV і є великим червоним прапорцем. Цей дозвіл може використовуватися для перехоплення 2FA кодів або крадіжки конфіденційної інформації. Завжди позначайте додатки з невідповідністю дозволів для ручної перевірки.

# question1Reference
source: Red Flags Guide - Permission Mismatch Analysis
uk: Посібник з червоних прапорців - Аналіз невідповідності дозволів

# question2
source: What is the primary risk of apps requesting ACCESSIBILITY_SERVICE permission?
uk: Який основний ризик додатків, що запитують дозвіл ACCESSIBILITY_SERVICE?

# question2Option1
source: They can access the internet
uk: Вони можуть отримати доступ до інтернету

# question2Option2
source: They can control other apps and steal sensitive data
uk: Вони можуть керувати іншими додатками та красти конфіденційні дані

# question2Option3
source: They can read device storage
uk: Вони можуть читати сховище пристрою

# question2Option4
source: They can make phone calls
uk: Вони можуть здійснювати телефонні дзвінки

# question2Explanation
source: Accessibility services can control other applications, simulate user interactions, and steal sensitive data from any app on the device. This is one of the most dangerous permissions and should never be granted to non-essential apps.
uk: Служби доступності можуть керувати іншими додатками, імітувати взаємодію користувача та красти конфіденційні дані з будь-якого додатку на пристрої. Це один з найнебезпечніших дозволів і ніколи не повинен надаватися неосновним додаткам.

# question2Reference
source: Red Flags Guide - Accessibility Service Abuse
uk: Посібник з червоних прапорців - Зловживання службою доступності

# question3
source: A VPN app requests permission to READ_CONTACTS. This is:
uk: VPN додаток запитує дозвіл на READ_CONTACTS. Це:

# question3Option1
source: Normal - VPN apps need to access contacts for security
uk: Нормально - VPN додаткам потрібен доступ до контактів для безпеки

# question3Option2
source: Suspicious - VPN apps should not need contact access
uk: Підозріло - VPN додаткам не потрібен доступ до контактів

# question3Option3
source: Required - for user authentication
uk: Необхідно - для автентифікації користувача

# question3Option4
source: Optional - depends on the VPN provider
uk: Опціонально - залежить від VPN провайдера

# question3Explanation
source: VPN apps do not need access to contacts. This is a clear red flag indicating potential data harvesting or social engineering attacks. Legitimate VPN services do not require contact access.
uk: VPN додаткам не потрібен доступ до контактів. Це явний червоний прапорець, що вказує на потенційний збір даних або атаки соціальної інженерії. Легітимні VPN сервіси не вимагають доступу до контактів.

# question3Reference
source: Red Flags Guide - VPN/IPTV Disguise
uk: Посібник з червоних прапорців - Маскування VPN/IPTV

# question4
source: What does dynamic code loading typically indicate in mobile apps?
uk: Що зазвичай вказує динамічне завантаження коду в мобільних додатках?

# question4Option1
source: Efficient app performance
uk: Ефективну продуктивність додатку

# question4Option2
source: Attempt to evade static analysis
uk: Спроба уникнути статичного аналізу

# question4Option3
source: Better user experience
uk: Кращий користувацький досвід

# question4Option4
source: Reduced app size
uk: Зменшений розмір додатку

# question4Explanation
source: Dynamic code loading is often used by malicious apps to download and execute additional payloads after passing initial security checks. This technique helps malware evade static analysis tools.
uk: Динамічне завантаження коду часто використовується шкідливими додатками для завантаження та виконання додаткових корисних навантажень після проходження початкових перевірок безпеки. Ця техніка допомагає шкідливому ПЗ уникнути інструментів статичного аналізу.

# question4Reference
source: Red Flags Guide - Dynamic Code Loading
uk: Посібник з червоних прапорців - Динамічне завантаження коду

# question5
source: An app with very few reviews (less than 10) and a recently created developer account is:
uk: Додаток з дуже невеликою кількістю відгуків (менше 10) та нещодавно створеним акаунтом розробника це:

# question5Option1
source: A new legitimate app
uk: Новий легітимний додаток

# question5Option2
source: Potentially suspicious and should be investigated
uk: Потенційно підозрілий і повинен бути розслідований

# question5Option3
source: Normal for small developers
uk: Нормально для малих розробників

# question5Option4
source: A sign of high quality
uk: Ознака високої якості

# question5Explanation
source: Apps with minimal reviews and recently created developer accounts are common indicators of app store evasion techniques. Malicious apps often use fake or compromised developer accounts to bypass security checks.
uk: Додатки з мінімальними відгуками та нещодавно створеними акаунтами розробників є поширеними індикаторами технік уникнення магазину додатків. Шкідливі додатки часто використовують фальшиві або скомпрометовані акаунти розробників для обходу перевірок безпеки.

# question5Reference
source: Red Flags Guide - App Store Evasion
uk: Посібник з червоних прапорців - Уникнення магазину додатків

# question6
source: What is the main risk of WebView phishing in mobile apps?
uk: Який основний ризик фішингу WebView в мобільних додатках?

# question6Option1
source: Slower app performance
uk: Повільніша продуктивність додатку

# question6Option2
source: Display of fake login pages to steal credentials
uk: Відображення фальшивих сторінок входу для крадіжки облікових даних

# question6Option3
source: Increased data usage
uk: Збільшене використання даних

# question6Option4
source: Poor user interface
uk: Поганий користувацький інтерфейс

# question6Explanation
source: WebView phishing uses WebView components to display convincing fake login pages that steal user credentials. The WebView can be styled to look exactly like legitimate banking or social media apps.
uk: Фішинг WebView використовує компоненти WebView для відображення переконливих фальшивих сторінок входу, які крадуть облікові дані користувача. WebView може бути стилізований так, щоб виглядати точно як легітимні банківські або соціальні додатки.

# question6Reference
source: Red Flags Guide - WebView Phishing
uk: Посібник з червоних прапорців - Фішинг WebView

# question7
source: An app requests REQUEST_INSTALL_PACKAGES permission. For most apps, this is:
uk: Додаток запитує дозвіл REQUEST_INSTALL_PACKAGES. Для більшості додатків це:

# question7Option1
source: Required for normal operation
uk: Необхідно для нормальної роботи

# question7Option2
source: A critical red flag indicating potential dropper malware
uk: Критичний червоний прапорець, що вказує на потенційне шкідливе ПЗ-дроппер

# question7Option3
source: Needed for app updates
uk: Потрібно для оновлень додатку

# question7Option4
source: Standard for all Android apps
uk: Стандартно для всіх Android додатків

# question7Explanation
source: REQUEST_INSTALL_PACKAGES permission allows apps to install other packages. This is rarely needed and is a major red flag for potential dropper malware that installs additional malicious apps.
uk: Дозвіл REQUEST_INSTALL_PACKAGES дозволяє додаткам встановлювати інші пакети. Це рідко потрібно і є великим червоним прапорцем для потенційного шкідливого ПЗ-дроппера, яке встановлює додаткові шкідливі додатки.

# question7Reference
source: Red Flags Guide - Installer Flow Abuse
uk: Посібник з червоних прапорців - Зловживання потоком встановлення

# question8
source: What should you do if an app's functionality doesn't match its requested permissions?
uk: Що ви повинні зробити, якщо функціональність додатку не відповідає його запитаним дозволам?

# question8Option1
source: Install it anyway - permissions might be for future features
uk: Встановити все одно - дозволи можуть бути для майбутніх функцій

# question8Option2
source: Flag it for manual review and investigate further
uk: Позначити для ручної перевірки та розслідувати далі

# question8Option3
source: Check user reviews to see if others had issues
uk: Перевірити відгуки користувачів, щоб побачити, чи були у інших проблеми

# question8Option4
source: Contact the developer for clarification
uk: Зв'язатися з розробником для уточнення

# question8Explanation
source: Permission mismatches are a major red flag and should always trigger manual review. Apps should only request permissions that are directly related to their stated functionality. This is a common technique used by malicious apps.
uk: Невідповідність дозволів є великим червоним прапорцем і завжди повинна запускати ручну перевірку. Додатки повинні запитувати тільки ті дозволи, які безпосередньо пов'язані з їх заявленою функціональністю. Це поширена техніка, яку використовують шкідливі додатки.

# question8Reference
source: Red Flags Guide - Permission Mismatch Analysis
uk: Посібник з червоних прапорців - Аналіз невідповідності дозволів

source: Real Example
uk: Реальний приклад

source: Source
uk: Джерело

source: Audit Indicators
uk: Індикатори аудиту

source: Protection Recommendations
uk: Рекомендації з захисту

source: Instructor Resources
uk: Ресурси для викладачів

# instructorDescription
source: This section provides educational materials, exercise scenarios, and templates for teaching mobile app security auditing.
uk: Цей розділ надає освітні матеріали, сценарії вправ та шаблони для навчання аудиту безпеки мобільних додатків.

source: Exercise Scenarios
uk: Сценарії вправ

source: Quick Reference Materials
uk: Швидкі довідкові матеріали

source: Teaching Tips
uk: Поради для викладання

# teachingTipsDescription
source: Best practices for teaching mobile app security auditing:
uk: Найкращі практики для навчання аудиту безпеки мобільних додатків:

# teachingTip1
source: Start with basic permission analysis before moving to advanced techniques
uk: Почніть з базового аналізу дозволів перед переходом до розширених технік

# teachingTip2
source: Use real-world examples and case studies to illustrate concepts
uk: Використовуйте реальні приклади та кейси для ілюстрації концепцій

# teachingTip3
source: Encourage students to think like attackers to understand motivations
uk: Заохочуйте студентів думати як атакуючі, щоб зрозуміти мотивації

# teachingTip4
source: Practice with both legitimate and malicious app examples
uk: Практикуйтеся з прикладами як легітимних, так і шкідливих додатків

# teachingTip5
source: Emphasize the importance of context in security analysis
uk: Підкреслюйте важливість контексту в аналізі безпеки

# teachingTip6
source: Use the quiz feature to reinforce learning objectives
uk: Використовуйте функцію вікторини для закріплення цілей навчання

# teachingTip7
source: Discuss ethical considerations and responsible disclosure
uk: Обговорюйте етичні аспекти та відповідальне розкриття

# scenario1
source: Scenario 1: Static APK Review
uk: Сценарій 1: Статичний огляд APK

# scenario1Subtitle
source: Manifest and Assets Analysis
uk: Аналіз маніфесту та ресурсів

# scenario1Description
source: Students analyze a simulated APK manifest and assets to identify suspicious permissions, activities, and resources. Focus on permission mismatches and obfuscation indicators.
uk: Студенти аналізують симульований маніфест APK та ресурси для виявлення підозрілих дозволів, активностей та ресурсів. Фокус на невідповідності дозволів та індикаторах обфускації.

# scenario2
source: Scenario 2: App Store Review
uk: Сценарій 2: Огляд магазину додатків

# scenario2Subtitle
source: Store Page and Screenshots Analysis
uk: Аналіз сторінки магазину та скріншотів

# scenario2Description
source: Students review simulated app store pages, descriptions, and screenshots to identify red flags in marketing materials and user-facing content.
uk: Студенти переглядають симульовані сторінки магазину додатків, описи та скріншоти для виявлення червоних прапорців у маркетингових матеріалах та контенті для користувачів.

# scenario3
source: Scenario 3: Risk Assessment Report
uk: Сценарій 3: Звіт про оцінку ризиків

# scenario3Subtitle
source: Comprehensive Security Analysis
uk: Комплексний аналіз безпеки

# scenario3Description
source: Students create detailed security assessment reports with risk prioritization, evidence collection, and remediation recommendations.
uk: Студенти створюють детальні звіти про оцінку безпеки з пріоритизацією ризиків, збором доказів та рекомендаціями щодо виправлення.

source: Audit Checklist
uk: Чек-лист аудиту

# auditChecklistDescription
source: Comprehensive checklist for mobile app security auditing
uk: Комплексний чек-лист для аудиту безпеки мобільних додатків

source: Permission Analysis Guide
uk: Посібник з аналізу дозволів

# permissionAnalysisGuideDescription
source: Detailed guide for analyzing Android permissions
uk: Детальний посібник для аналізу дозволів Android

source: Red Flags Summary
uk: Підсумок червоних прапорців

# redFlagsSummaryDescription
source: Quick reference for common security red flags
uk: Швидка довідка по поширеним червоним прапорцям безпеки

source: Download Manifest Example
uk: Завантажити приклад маніфесту

source: Download Store Examples
uk: Завантажити приклади магазину

source: Download Report Template
uk: Завантажити шаблон звіту

# developerInformationMissing
source: Developer information missing or incomplete
uk: Інформація про розробника відсутня або неповна

source: Normal Permissions
uk: Звичайні дозволи

source: SMS Access
uk: Доступ до SMS

# smsAccessDescription
source: Allows the app to read and send SMS messages.
uk: Дозволяє додатку читати та надсилати SMS повідомлення.

source: Install Packages
uk: Встановлення пакетів

# installPackagesDescription
source: Allows the app to install other applications.
uk: Дозволяє додатку встановлювати інші додатки.

source: Camera Access
uk: Доступ до камери

# cameraAccessDescription
source: Allows the app to take pictures and record videos.
uk: Дозволяє додатку робити фотографії та записувати відео.

source: Contacts Access
uk: Доступ до контактів

# contactsAccessDescription
source: Allows the app to read your contacts.
uk: Дозволяє додатку читати ваші контакти.

source: Location Access
uk: Доступ до місцезнаходження

# locationAccessDescription
source: Allows the app to access your device's location.
uk: Дозволяє додатку отримувати доступ до місцезнаходження вашого пристрою.

source: Storage Access
uk: Доступ до сховища

# storageAccessDescription
source: Allows the app to read and write to your device's storage.
uk: Дозволяє додатку читати та записувати в сховище вашого пристрою.

source: Internet Access
uk: Доступ до інтернету

# internetAccessDescription
source: Allows the app to open network sockets.
uk: Дозволяє додатку відкривати мережеві сокети.

source: Network State Access
uk: Доступ до стану мережі

# networkStateAccessDescription
source: Allows the app to view network connection information.
uk: Дозволяє додатку переглядати інформацію про мережеве з'єднання.

source: Wake Lock
uk: Блокування сну

# wakeLockDescription
source: Allows the app to prevent the device from sleeping.
uk: Дозволяє додатку запобігати переходу пристрою в режим сну.
